In [1]:
import pandas as pd

**문제 1**

원본 csv 파일 다운로드: https://www.manning.com/books/pandas-workout

In [2]:
filename = '../data/nyc-parking-violations-2020-min.csv'

df = pd.read_csv(filename,
                usecols=['Date First Observed', 'Plate ID', 'Registration State',
                        'Issue Date', 'Vehicle Make', 'Street Name', 'Vehicle Color'])
df.columns

Index(['Plate ID', 'Registration State', 'Issue Date', 'Vehicle Make',
       'Street Name', 'Date First Observed', 'Vehicle Color'],
      dtype='object')

In [3]:
df

,Plate ID,Registration State,Issue Date,Vehicle Make,Street Name,Date First Observed,Vehicle Color
0,C15KHR,NJ,01/23/2020 12:00:00 AM,NISSA,Park Ave,0,BLACK
1,JET2329,NY,03/09/2020 12:00:00 AM,CHEVR,Ericson Pl,0,DKG
2,HTW7066,NY,04/03/2020 12:00:00 AM,LEXUS,NB MCGUINNESS BLVD @,0,GY
3,22105ME,NY,08/30/2019 12:00:00 AM,INTER,E 59th St,0,WH
4,HRD6376,NY,04/23/2020 12:00:00 AM,HONDA,SB RICHMOND RD @ NAR,0,BK
...,...,...,...,...,...,...,...
24987,520878R,NJ,12/19/2019 12:00:00 AM,HONDA,President St,0,GREY
24988,20238ML,NY,08/30/2019 12:00:00 AM,FORD,3rd Ave,20190830,WH
24989,CKV1282,NY,09/12/2019 12:00:00 AM,NISSA,82ND AVENUE,0,GRAY
24990,GZL9718,NY,07/09/2019 12:00:00 AM,JEEP,E 175th St,0,WH
24991,PAPAJOE4,NY,11/11/2019 12:00:00 AM,ACURA,SB BELL BLVD @ 18TH,0,BK

In [4]:
# set the index to the "Issue Date" column
df = df.set_index('Issue Date')

In [5]:
# what three vehicle makes were most likely to be ticketed on January 2nd?
df.loc['01/02/2020 12:00:00 AM', 'Vehicle Make'].value_counts().head(3)

NISSA    9
FORD     7
TOYOT    6
Name: Vehicle Make, dtype: int64

In [6]:
# On what five streets were cars most likely to be ticketed on June 1st, 2020?
df.loc['06/01/2020 12:00:00 AM', 'Street Name'].value_counts().head(5)

WB ATLANTIC AVE @ SH    2
WB LINDEN BLVD @ ROC    2
SB FRANCIS LEWIS BLV    2
WB GOETHALS RD N @ J    2
WB ATLANTIC AVE @ CL    1
Name: Street Name, dtype: int64

In [7]:
# change the index to be "Vehicle Color"
df = df.reset_index().set_index('Vehicle Color')

In [8]:
# What was the most common make of ticketed cars that were either blue or red?
df.loc[['BLUE', 'RED'], 'Vehicle Make'].value_counts().head(1)

HONDA    69
Name: Vehicle Make, dtype: int64

# Beyond 1

What were the three most commonly ticket car makes to be issued tickets on January 2nd through January 10th?

In [9]:
# set the index to the "Issue Date" column
df = df.set_index('Issue Date')

In [10]:
# We can use a slice, but only after sorting the index from lo
df = df.sort_index()

In [11]:
df

,Plate ID,Registration State,Vehicle Make,Street Name,Date First Observed
Issue Date,,,,,
01/01/2020 12:00:00 AM,HHT6914,NY,KIA,111 AVE,0
01/01/2020 12:00:00 AM,T672382C,NY,TOYOT,SB 2 Avenue @ E 101,0
01/01/2020 12:00:00 AM,HFS8244,NY,HYUND,CADMAN PLAZA (E/B) @,0
01/01/2020 12:00:00 AM,KXL1710,PA,TOYOT,EAST 21 STREET,0
01/02/2020 12:00:00 AM,GJE1053,NY,CADI,E/S 107TH STREET,0
...,...,...,...,...,...
12/31/2019 12:00:00 AM,FPF2427,NY,AUDI,SB ROCKAWAY PKWY @ A,0
12/31/2019 12:00:00 AM,4H93A2,TN,TOYOT,59th St,0
12/31/2019 12:00:00 AM,JHJ2790,NY,INFIN,EB JAMAICA AVE @ 193,0
12/31/2019 12:00:00 AM,768RRX,CT,FORD,E 3rd St,0
12/31/2019 12:00:00 AM,GYG7256,NY,HYUND,EB LINDEN BLVD @ HEM,0

In [12]:
df.loc['01/02/2020 12:00:00 AM':'01/10/2020 12:00:00 AM', 'Vehicle Make'].value_counts().head(3)

FORD     85
HONDA    84
TOYOT    68
Name: Vehicle Make, dtype: int64

# Beyond 2

How many tickets did the second-most-ticketed car get in 2020?  (And why am I not interested in the most-ticketed plate?) What state was that car from, and was it always ticketed in the same location?

In [13]:
# Most common plate is... BLANKPLATE!
# Second-most common is 2704819
df = df.reset_index()
df['Plate ID'].value_counts().head(2)

BLANKPLATE    15
70702PC        6
Name: Plate ID, dtype: int64

In [14]:
# It's from Indiana
df = df.set_index('Plate ID')
df.loc['2704819', 'Registration State']

Plate ID
2704819    IN
2704819    IN
2704819    IN
2704819    IN
2704819    IN
Name: Registration State, dtype: object

In [15]:
# was it always ticketed in the same place?  No, but there were a lot in the same area...
df.loc['2704819', 'Street Name'].value_counts()

Broadway     1
8 AVENUE     1
7th Ave      1
W 34th St    1
8th Ave      1
Name: Street Name, dtype: int64

# Beyond 3

Would it be useful to set the index to "Date First Observed"? Why or why not?

In [16]:
# Not very useful -- the value is set to 0 for 99% of the values!

df = df.reset_index()
df['Date First Observed'].value_counts()

0           24744
20200124        5
20200316        4
20190716        4
20200305        4
            ...
20190731        1
20200307        1
20190725        1
20200309        1
20191231        1
Name: Date First Observed, Length: 163, dtype: int64

**문제 2**

In [17]:
filename = '../data/sat-scores.csv'

df = pd.read_csv(filename,
                usecols=['Year', 'State.Code', 'Total.Math', 'Total.Test-takers', 'Total.Verbal'],
                index_col=['Year', 'State.Code'])
df.head()

                 Total.Math  Total.Test-takers  Total.Verbal
Year State.Code
2005 AL                 559               3985           567
     AK                 519               3996           523
     AZ                 530              18184           526
     AR                 552               1600           563
     CA                 522             186552           504

In [18]:
df.loc[(2010, ['NY', 'NJ', 'MA', 'IL']), 'Total.Math'].mean()

535.25

In [19]:
# How many people took the SAT, total, in 2005?
df.loc[2005, 'Total.Test-takers'].sum()

1344824

In [20]:
# What was the average SAT math score in 2010 from New York, New Jersey, Massachusetts, and Illinois?
df.loc[(2010, ['NY', 'NJ', 'MA', 'IL']), 'Total.Math'].mean()

535.25

In [21]:
# What was the average SAT verbal score in 2016-2018 from Arizona, California, and Texas?
df.loc[([2012,2013,2014,2015], ['AZ', 'CA', 'TX']), 'Total.Math'].mean()

511.5833333333333

# Beyond 1

What were the average math and verbal scores for Florida, Indiana, and Idaho across all years? (You don't break out the values by state.)

In [22]:
df.loc[(slice(None), ['FL', 'IN', 'ID']), ['Total.Math', 'Total.Verbal']].mean()

Total.Math      507.090909
Total.Verbal    504.606061
dtype: float64

# Beyond 2

Which state received the highest verbal score, and in which year?

In [23]:
df[df['Total.Verbal'] == df['Total.Verbal'].max()]

                 Total.Math  Total.Test-takers  Total.Verbal
Year State.Code
2013 ND                 613                174           612

# Beyond 3

Was the average math score in 2005 higher or lower than that in 2015?

In [24]:
# when we have a multi-index, we can ignore the second level 
df.loc[2005, 'Total.Math'].mean() - df.loc[2015, 'Total.Math'].mean()

2.559506531204647

**문제 3**

In [25]:
filename = '../data/olympic_athlete_events.csv'

df = pd.read_csv(filename)

In [26]:
df

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
271111,135569,Andrzej ya,M,29.0,179.0,89.0,Poland-1,POL,1976 Winter,1976,Winter,Innsbruck,Luge,Luge Mixed (Men)'s Doubles,NaN
271112,135570,Piotr ya,M,27.0,176.0,59.0,Poland,POL,2014 Winter,2014,Winter,Sochi,Ski Jumping,"Ski Jumping Men's Large Hill, Individual",NaN
271113,135570,Piotr ya,M,27.0,176.0,59.0,Poland,POL,2014 Winter,2014,Winter,Sochi,Ski Jumping,"Ski Jumping Men's Large Hill, Team",NaN
271114,135571,Tomasz Ireneusz ya,M,30.0,185.0,96.0,Poland,POL,1998 Winter,1998,Winter,Nagano,Bobsleigh,Bobsleigh Men's Four,NaN
271115,135571,Tomasz Ireneusz ya,M,34.0,185.0,96.0,Poland,POL,2002 Winter,2002,Winter,Salt Lake City,Bobsleigh,Bobsleigh Men's Four,NaN

In [6]:
filename = '../data/olympic_athlete_events.csv'

df = pd.read_csv(filename,
                index_col=['Year', 'Season', 'Sport', 'Event'],
                usecols=['Age', 'Height', 'Team', 'Year', 'Season', 'City', 'Sport', 'Event', 'Medal'])
df = df.sort_index()
df.head()

                                                     Age  Height  \
Year Season Sport     Event
1896 Summer Athletics Athletics Men's 1,500 metres  24.0     NaN
                      Athletics Men's 1,500 metres   NaN     NaN
                      Athletics Men's 1,500 metres  22.0     NaN
                      Athletics Men's 1,500 metres  23.0   154.0
                      Athletics Men's 1,500 metres  21.0     NaN

                                                             Team    City  \
Year Season Sport     Event
1896 Summer Athletics Athletics Men's 1,500 metres  United States  Athina
                      Athletics Men's 1,500 metres         Greece  Athina
                      Athletics Men's 1,500 metres      Australia  Athina
                      Athletics Men's 1,500 metres        Germany  Athina
                      Athletics Men's 1,500 metres         Greece  Athina

                                                     Medal
Year Season Sport     Event
1896 Summer Athletics Athletics Men's 1,500 metres  Silver
                      Athletics Men's 1,500 metres     NaN
                      Athletics Men's 1,500 metres    Gold
                      Athletics Men's 1,500 metres     NaN
                      Athletics Men's 1,500 metres     NaN

In [8]:
# What is the average age for winning athletes in summer games held between 1936 and 2000?
df.loc[(slice(1936,2000), 'Summer'), 'Age'].mean()

25.026883940421765

In [9]:
# What team has won the greatest number of medals for all archery events?
df.loc[(slice(None), 'Summer', 'Archery'), 'Team'].value_counts()

United States      155
France             151
Great Britain      133
South Korea        102
China               98
                  ...
Vanuatu              1
Guam                 1
Jordan               1
Solomon Islands      1
Azerbaijan           1
Name: Team, Length: 102, dtype: int64

In [10]:
# Starting in 1980, what is the average height of the event known as "Table Tennis Women's Team"?
df.loc[(slice(None), 'Summer', slice(None), "Table Tennis Women's Team"), 'Height'].mean()

165.04827586206898

In [11]:
# Starting in 1980, what is the average height of either "Table Tennis Women's Team" or "Table Tennis Men's Team"?
df.loc[(slice(None), 'Summer', slice(None), ["Table Tennis Men's Team", "Table Tennis Women's Team"]), 'Height'].mean()

171.26643598615917

In [12]:
# How tall was the tallest-ever tennis medalist in Olympic games from 1980 until 2016?
df.loc[(slice(1980,2016), 'Summer', 'Tennis'), 'Height'].max()

208.0